
## Plan Result (prod_gameserver)




<pre><code>Plan: 14 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_network_security_group.this[&#34;private&#34;]
  * azurerm_network_security_group.this[&#34;public&#34;]
  * azurerm_network_security_rule.this[&#34;Allow2022&#34;]
  * azurerm_network_security_rule.this[&#34;Allow22&#34;]
  * azurerm_network_security_rule.this[&#34;Allow443&#34;]
  * azurerm_network_security_rule.this[&#34;Allow8080&#34;]
  * azurerm_network_security_rule.this[&#34;AllowGameServerPorts&#34;]
  * azurerm_network_security_rule.this[&#34;DenyAll&#34;]
  * azurerm_resource_group.game_server
  * azurerm_subnet.this[&#34;private&#34;]
  * azurerm_subnet.this[&#34;public&#34;]
  * azurerm_subnet_network_security_group_association.this[&#34;private&#34;]
  * azurerm_subnet_network_security_group_association.this[&#34;public&#34;]
  * azurerm_virtual_network.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_network_security_group.this["private"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "games-prod-private-nsg"
      + resource_group_name = "games-prod-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "application" = "game_servers"
          + "environment" = "prod"
        }
    }

  # azurerm_network_security_group.this["public"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "games-prod-public-nsg"
      + resource_group_name = "games-prod-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "application" = "game_servers"
          + "environment" = "prod"
        }
    }

  # azurerm_network_security_rule.this["Allow2022"] will be created
  + resource "azurerm_network_security_rule" "this" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "2022"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Allow2022"
      + network_security_group_name = "games-prod-public-nsg"
      + priority                    = 1040
      + protocol                    = "Tcp"
      + resource_group_name         = "games-prod-rg"
      + source_address_prefix       = (sensitive value)
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.this["Allow22"] will be created
  + resource "azurerm_network_security_rule" "this" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "22"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Allow22"
      + network_security_group_name = "games-prod-public-nsg"
      + priority                    = 1010
      + protocol                    = "Tcp"
      + resource_group_name         = "games-prod-rg"
      + source_address_prefix       = (sensitive value)
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.this["Allow443"] will be created
  + resource "azurerm_network_security_rule" "this" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Allow443"
      + network_security_group_name = "games-prod-public-nsg"
      + priority                    = 1020
      + protocol                    = "Tcp"
      + resource_group_name         = "games-prod-rg"
      + source_address_prefix       = (sensitive value)
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.this["Allow8080"] will be created
  + resource "azurerm_network_security_rule" "this" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "8080"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Allow8080"
      + network_security_group_name = "games-prod-public-nsg"
      + priority                    = 1030
      + protocol                    = "Tcp"
      + resource_group_name         = "games-prod-rg"
      + source_address_prefix       = (sensitive value)
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.this["AllowGameServerPorts"] will be created
  + resource "azurerm_network_security_rule" "this" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "27000-27100"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowGameServerPorts"
      + network_security_group_name = "games-prod-public-nsg"
      + priority                    = 1050
      + protocol                    = "*"
      + resource_group_name         = "games-prod-rg"
      + source_address_prefix       = (sensitive value)
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.this["DenyAll"] will be created
  + resource "azurerm_network_security_rule" "this" {
      + access                      = "Deny"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "DenyAll"
      + network_security_group_name = "games-prod-public-nsg"
      + priority                    = 4096
      + protocol                    = "*"
      + resource_group_name         = "games-prod-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_resource_group.game_server will be created
  + resource "azurerm_resource_group" "game_server" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "games-prod-rg"
      + tags     = {
          + "application" = "game_servers"
          + "environment" = "prod"
        }
    }

  # azurerm_subnet.this["private"] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                              = [
          + "10.151.201.0/25",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "games-prod-private-subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "games-prod-rg"
      + virtual_network_name                          = "games-prod-vnet"
    }

  # azurerm_subnet.this["public"] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                              = [
          + "10.151.201.128/25",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "games-prod-public-subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "games-prod-rg"
      + virtual_network_name                          = "games-prod-vnet"
    }

  # azurerm_subnet_network_security_group_association.this["private"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_subnet_network_security_group_association.this["public"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_virtual_network.this will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space                  = [
          + "10.151.201.0/24",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "uksouth"
      + name                           = "games-prod-vnet"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "games-prod-rg"
      + subnet                         = (known after apply)
      + tags                           = {
          + "application" = "game_servers"
          + "environment" = "prod"
        }
    }

Plan: 14 to add, 0 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_resource_group.game_server has been deleted
  - resource "azurerm_resource_group" "game_server" {
        id         = "/subscriptions/ca9663cd-26bb-4c47-b084-e527a512d372/resourceGroups/games-prod-rg"
      - location   = "uksouth" -> null
      - name       = "games-prod-rg" -> null
        tags       = {
            "application" = "game_servers"
            "environment" = "prod"
        }
        # (1 unchanged attribute hidden)
    }

  # azurerm_virtual_network.this has been deleted
  - resource "azurerm_virtual_network" "this" {
        id                             = "/subscriptions/ca9663cd-26bb-4c47-b084-e527a512d372/resourceGroups/games-prod-rg/providers/Microsoft.Network/virtualNetworks/games-prod-vnet"
      - name                           = "games-prod-vnet" -> null
        tags                           = {
            "application" = "game_servers"
            "environment" = "prod"
        }
        # (10 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":556,"Program":"tfcmt","SHA1":"","Target":"prod_gameserver","Vars":{}} -->